## Project 1: Personal Finance Analysis

In this study, I wanted to investigate how major life events (and the COVID-19 pandemic) have affected my spending from 2017 to 2020. The following data was extracted from my Mint (Intuit) profile and includes all transactions that were made with by debit card, credit card, peer-to-peer transfer (e.g., Zelle), or check. It does not include cash transactions, cash gifts, or gift cards; however, since using a card or money transfer is the most popular method to complete transactions, this analysis should give an accurate estimation of how my spending patterns have changes over time.

Questions for this analysis:
1. How have the spending patterns changed due to a move?
2. How have the spending patterns changed due to a change in employment? 
3. How have the spending patterns changed due to marriage? 
4. How has the COVID-19 pandemic affected these spending patterns for the year 2020?

We are particularly interested in changes in food and travel expenses related to the COVID-19 pandemic.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [63]:
expenses = pd.read_csv('./totals/all_time_spending.csv')
expenses = expenses.drop(0)
# expenses.head(10)

# df.drop(df.head(n).index,inplace=True) # drop first n rows

expenses.drop(expenses.tail(2).index, inplace=True) # drop last n=2 rows
expenses

             Dates   Spending
1     January 2014  $1,897.84
2    February 2014  $2,302.91
3       March 2014  $4,023.44
4       April 2014  $2,853.33
5         May 2014  $1,699.02
..             ...        ...
80     August 2020  $5,973.40
81  September 2020  $1,626.05
82    October 2020  $5,580.04
83   November 2020  $2,164.89
84   December 2020  $2,725.43

[84 rows x 2 columns]

In [22]:
x = "January 2017"
type(x)

y = x.split()

print(x)
print(y)

January 2017
['January', '2017']

In [ ]:
# expenses.Spending[4]

# plt.plot(expenses['Dates'], expenses['Spending'], 'b.-')

# my_bins = [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000]
# plt.hist(expenses['Spending'], bins=my_bins)
# plt.xticks(my_bins)

# plt.show()

In [34]:
type(expenses['Dates'][1])

str

In [64]:
new = expenses["Dates"].str.split(" ", n=1, expand=True)

# making separate Month column from new data frame 
expenses["Month"]= new[0] 
  
# making separate Year column from new data frame 
expenses["Year"]= new[1] 

expenses

             Dates   Spending      Month  Year
1     January 2014  $1,897.84    January  2014
2    February 2014  $2,302.91   February  2014
3       March 2014  $4,023.44      March  2014
4       April 2014  $2,853.33      April  2014
5         May 2014  $1,699.02        May  2014
..             ...        ...        ...   ...
80     August 2020  $5,973.40     August  2020
81  September 2020  $1,626.05  September  2020
82    October 2020  $5,580.04    October  2020
83   November 2020  $2,164.89   November  2020
84   December 2020  $2,725.43   December  2020

[84 rows x 4 columns]

In [65]:
expenses.describe()

               Dates   Spending     Month  Year
count             84         84        84    84
unique            84         84        12     7
top     January 2018  $4,735.27  February  2015
freq               1          1         7    12